<%@ page language="java" import="java.util.*" pageEncoding="UTF-8"%>
<%
String path = request.getContextPath();
String basePath = request.getScheme()+"://"+request.getServerName()+":"+request.getServerPort()+path+"/";
%>

<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
  <head>
    <base href="<%=basePath%>">
    
	<meta http-equiv="pragma" content="no-cache">
	<meta http-equiv="cache-control" content="no-cache">
	<meta http-equiv="expires" content="0">    
	<meta http-equiv="keywords" content="keyword1,keyword2,keyword3">
	<meta http-equiv="description" content="This is my page">
    <meta name="viewport" content="width=device-width, initial-scale=1">
	<!--
	<link rel="stylesheet" type="text/css" href="styles.css">
	-->
	<link rel="stylesheet" href="<%=basePath%>/css/bootstrap/css/bootstrap.min.css" type="text/css" />
    <link rel="stylesheet" href="<%=basePath%>/css/agreement/agreement.css" type="text/css" />
	
	<script type="text/javascript" src="<%=basePath%>/js/scripts/jquery-1.11.1.min.js"></script>
    <script type="text/javascript" src="<%=basePath%>/js/scripts/bootstrap.min.js"></script>

  </head>
  
  <body>
    <div class="container panel panel-default">
        <div class="title panel-body"><h2>剧易拍系统隐私条款</h2></div>
        <div class="content panel-body">
           <h4>总则</h4>
           <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;剧易拍是北京小土科技有限公司（以下简称“小土科技”）为您提供的制片管理软件，通过对剧本进行规范化解析和自动化分析，精确把握剧组各类管理报表，根据剧组各部门汇总的时间档期以及准备工作的情况，按生产计划排期，生成各种计划、通告等生产单据；通过制定剧组预算、合同以及对剧组发生的收款、付款、借款等财务数据的录入，实时对剧组的财务信息进行把控。</p>
           <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;小土科技一贯重视用户信息的保护。在您使用小土科技剧易拍服务时可能会收集和使用您的个人信息，为此，通过本《剧易拍隐私条款》（以下简称“本《隐私条款》”）向您说明您在使用剧易拍时，剧易拍是如何收集、存储、使用和分享您的信息，以及剧易拍向您提供的访问、更新、控制和保护信息的方式。</p>
           <h4>1、隐私条款的确认与接纳</h4>
           <p>1.1、本《隐私条款》与您所使用的剧易拍服务息息相关，希望您仔细阅读并充分理解，包括免除或者限制小土科技责任的免责条款及对您的权利限制条款。请您审慎阅读（未成年人请在监护人陪同下阅读）并选择接受或不接受本《隐私条款》。除非您接受本《隐私条款》，否则您无权注册、登录或使用剧易拍相关服务。您的注册、登录、使用等行为将视为对本《隐私条款》的接受，视为您同意接受各项条款的约束。</p>
           <p>1.2、您对本《隐私条款》的接受即自愿接受全部条款的约束，包括接受小土科技对任一条款随时所做的任何修改。本《隐私条款》可由小土科技随时更新，更新后的《隐私条款》一旦公布即代替原来的《隐私条款》，恕不再另行通知，您可在本平台查阅最新版条款内容。在小土科技修改本《隐私条款》之后，如果您不接受修改后的条款，请立即停止使用剧易拍服务，您继续使用剧易拍服务将被视为您已接受了修改后的《隐私条款》。</p>
           <h4>2、信息范围</h4>
           <p>2.1、本《隐私条款》所述的信息，是指个人姓名、身份证号等单独或与其他信息对照可以作为特定的个人信息；您登录和使用剧易拍平台时间、时长、浏览记录等；您所使用的计算机、移动设备的品牌、型号、IP地址以及软件版本信息，通过cookie或者其他方式自动采集到的您的信息。</p>
           <p>2.2、您承诺并保证：您主动填写或者提供给剧易拍的个人信息是真实的、准确的、完整的，在信息内容发生变化时，您及时通过原有的渠道或者剧易拍提供的新的渠道进行更新，以确保剧易拍所获得的您的个人信息是最新的、真实的、准确的和完整的；否则，剧易拍无需承担由此给您造成的任何损失。</p>
           <h4>3、信息收集</h4>
           <p>3.1、在您注册剧易拍账户时，剧易拍会要求您提供个人信息。</p>
           <p>3.2、在您使用剧易拍服务，访问剧易拍页面时，剧易拍自动接收并记录的您浏览器上的服务器数值，包括但不限于IP地址等数据和您要求取用的网页记录。</p>
           <p>3.3、剧易拍会收集您在剧易拍进行操作产生的有关数据。</p>
           <p>3.4、剧易拍可能通过合法途径从商业伙伴处获取您个人数据信息。</p>
           <p>3.5、收集您通过剧易拍服务向其他方提供的共享信息，您使用剧易拍服务时所储存的信息以及其他方使用剧易拍服务时所提供有关您的共享信息。</p>
           <p>3.6、您在注册账号或使用剧易拍服务的过程中，可能需要填写或提交一些其他必要的信息，如您提交的信息不完整、不真实或不符合法律法规的规定，则您可能无法使用剧易拍服务或在使用剧易拍服务的过程中受到限制。</p>
           <h4>4、信息使用</h4>
           <p>4.1、在我们提供服务时，用于身份验证、客户服务、安全防范、诈骗监测、存档和备份用途，确保剧易拍向您提供的产品和服务的安全性。</p>
           <p>4.2、通过使用收集的信息，使我们更加了解您如何接入和使用我们的服务，从而针对性地回应您的个性化需求，改进剧易拍服务。</p>
           <p>4.3、您充分理解并完全接受剧易拍在以下事项中使用您的个人信息</p>
           <p>(1) 向您及时发送重要通知，如软件更新、服务条款的变更；</p>
           <p>(2) 内部进行审计、数据分析和研究等，以改进剧易拍服务和强化与您之间的沟通；</p>
           <p>(3) 依服务协议约定，剧易拍管理、审查您的信息及进行处理措施；</p>
           <p>(4) 适用法律法规规定的其他事项；</p>
           <p>4.4、剧易拍会以高度的勤勉义务对待用户信息，不会对您的信息进行不法使用。</p>
           <h4>5、信息披露</h4>
           <p>5.1、您充分理解并完全接受：保护用户信息是剧易拍一贯原则，剧易拍不会向任何第三方透漏您的信息，但存在下列任何一项情形披露给第三方的除外</p>
           <p>（1）基于国家法律法规的规定而对外披露；</p>
           <p>（2）应国家司法机关及其他有法律权限的政府机关基于法定程序的要求而披露；</p>
           <p>（3）为保护剧易拍或您的合法权益而披露；</p>
           <p>（4）在紧急情况下，为保护其他用户或者第三方人身安全而披露；</p>
           <p>（5）您本人或其监护人授权披露，如您使用共享功能、您与剧易拍及合作单位之间就您个人隐私信息的使用公开达成约定等；</p>
           <p>（6）应用户的监护人的合法要求而向其披露；</p>
           <p>（7）以学术研究或公共利益为目的；</p>
           <p>（8）为维护相关方合法权益，例如查找、预防、处理欺诈或安全方面的问题；</p>
           <p>（9）符合相关服务条款或使用协议的规定；</p>
           <p>（10）任何由于黑客攻击、电脑病毒侵入及其他不可抗力事件导致您个人信息的泄露；</p>
           <p>5.2、剧易拍即便是按照约定将用户信息披露给第三方，亦会要求接收信息的第三方严格按照国家法律法规使用和保护信息；</p>
           <h4>6、信息安全</h4>
           <p>6.1、剧易拍仅在本《隐私条款》所必需的期间和法律法规要求的时限内保留您的个人信息。</p>
           <p>6.2、剧易拍使用各种安全技术和程序，以防信息的丢失、不当使用、未经授权阅览或披露。如果您发现自己个人信息泄露，尤其是剧易拍账户及密码发生泄露、毁损或丢失，请您立即联络剧易拍客服，以便剧易拍采取相应措施。</p>
           <p>6.3、您充分理解并完全接受：即便是剧易拍采取各种安全技术和程序存储、保护用户信息，防止其被未经授权的访问、使用、复制和泄露，但用户信息仍然有可能发生被黑客攻击、窃取，因不可抗力或者其他非剧易拍的自身原因而被泄露的情形。对此，只要是剧易拍采取了必要的措施防止上述情形之发生，并在上述情形发生之后采取必要的措施防止其损失进一步扩大，剧易拍无须赔偿由此给您造成的任何损失。</p>
           <h4>7、Cookie的使用</h4>
           <p>7.1、运用cookie技术，剧易拍能够为您提供更加周到的个性化服务，并允许您设定您特定的服务选项。您可以通过修改浏览器设置的方式拒绝Cookie，如果您选择拒绝Cookie，则您可能无法登录或使用依赖于Cookie 的剧易拍服务或功能。通过剧易拍所设Cookie所取得的有关信息，将适用本《隐私条款》。</p>
           <p>7.2、当您使用产品或服务时，会向您的设备存储Cookie。当您与剧易拍网站上发布广告进行交互时，我们允许Cookie或者匿名标识符发送给服务器。通过广告在您计算机上设定的Cookie，将适用广告公司的隐私条款。</p>
           <h4>8、其他</h4>
           <p>8.1、您充分理解并完全接受：小土科技或者合法接收了小土科技提供的用户信息的第三方企业发生合并或者分立，那么合并或者分立后企业仍然有权按照本《隐私条款》及其他相关约定收集、存储、保护、使用和分享用户信息，而无须另行征得您的同意。</p>
           <p>8.2、您充分理解并完全接受：本《隐私条款》已经向您充分说明了剧易拍是如何收集、存储、使用、保护以及分享您的用户信息，若您对本《隐私条款》存在疑问或者异议，可以询问剧易拍客服。除此之外，剧易拍没有义务另行以其他书面的方式再向您说明。但如果剧易拍有另行书面说明，且与本《隐私条款》相矛盾或者不一致的，以另行书面说明的为准；未尽事宜，仍以本《隐私条款》为准。</p>
           <p>8.3、本《隐私条款》中各条款是可分的，所约定的任何条款如果部分或者全部无效，不影响该条款其他部分及本《隐私条款》其他条款的法律效力。</p>
           <p>8.4、小土科技保留对本《隐私条款》作出相应修改、解释的权利。</p>
        </div>
        <!-- <div class="bottom">
           <input type="button" value="关闭本页" onclick="closePage()">
        </div> -->
    </div>
  </body>
</html>
